Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་འོ་ན་མ་སྐྱེས་པའི་ལམ་གྱིས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་ལགས་སམ།
en: Well then, Blessed Lord, is enlightenment attained by a path that does not arise?” “

source: བཅོམ་ལྡན་འདས་འོ་ན་སྐྱེས་ཀྱང་སྐྱེས་ལ་མ་སྐྱེས་ཀྱང་མ་སྐྱེས་པའི་ལམ་གྱིས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་ལགས་སམ།
en: Well then, Blessed Lord, is enlightenment attained by a path that both arises and does not arise?” “

source: བཅོམ་ལྡན་འདས་འོ་ན་སྐྱེས་པ་ཡང་མ་ལགས། མ་སྐྱེས་པ་ཡང་མ་ལགས་པའི་ལམ་གྱིས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་ལགས་སམ།
en: Well then, Blessed Lord, is enlightenment attained by a path that neither arises nor does not arise?” “

source: བཅོམ་ལྡན་འདས་འོ་ན་བྱང་ཆུབ་ཇི་ལྟར་ཐོབ་པར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Well then, Blessed Lord, how is enlightenment attained?” “

source: རབ་འབྱོར་བྱང་ཆུབ་ནི་ལམ་གྱིས་འཐོབ་པ་ཡང་མ་ཡིན། ལམ་མ་ཡིན་པས་འཐོབ་པ་ཡང་མ་ཡིན་ཏེ། བྱང་ཆུབ་ཉིད་ཀྱང་ལམ་མོ། །ལམ་ཉིད་ཀྱང་བྱང་ཆུབ་བོ། །གསོལ་པ།
en: Subhūti,” replied the Blessed One, “enlightenment will not be attained by means of the path, nor will it be attained by means of that which is not the path.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བྱང་ཆུབ་ཉིད་ཀྱང་ལམ་ལ། ལམ་ཉིད་ཀྱང་བྱང་ཆུབ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བྱང་ཆུབ་སྔ་ནས་ཐོབ་པར་འགྱུར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་།
en: Enlightenment itself is the path and the path itself is enlightenment.” {

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་།
en: Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། ཐུགས་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱིས་བརྗོད་དོ་ཞེས་ཀྱང་ཅིའི་སླད་དུ་བསྟན།
en: VIII: 124} “Blessed Lord, if enlightenment itself is the path and the path itself is enlightenment, then bodhisattva great beings will have already attained enlightenment, so why then is it taught that the tathāgatas, arhats, completely awakened buddhas are described in accordance with the thirty-two major marks of a great person, the eighty excellent minor marks, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སངས་རྒྱས་ཤིག་བྱང་ཆུབ་ཐོབ་པར་བྱེད་པ་ཡིན་ནམ།
en: Subhūti, do you think that the buddhas attain enlightenment?”

source: །སངས་རྒྱས་ནི་བྱང་ཆུབ་ཐོབ་པར་མི་མཛད་དེ།
en: The buddhas do not attain enlightenment.

source: སངས་རྒྱས་ཉིད་ཀྱང་བྱང་ཆུབ་བོ། །བྱང་ཆུབ་ཉིད་ཀྱང་སངས་རྒྱས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The buddhas are themselves enlightenment, and enlightenment is itself the buddhas.” “

source: རབ་འབྱོར་གང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བྱང་ཆུབ་སྔ་ནས་ཐོབ་པར་འགྱུར་རོ་ཞེས་སྨྲས་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས། སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་རྫོགས་པར་བྱས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་།
en: Subhūti,” continued the Blessed One, “you just said bodhisattva great beings will have already attained enlightenment.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱས་ཤིང་། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱིས་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས།
en: In this regard, Subhūti, after perfecting the perfections; after perfecting all the aspects of emptiness; after perfecting the thirty-seven factors conducive to enlightenment; after perfecting the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; and after perfecting the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, bodhisattva great beings will attain consummate buddhahood in unsurpassed, complete enlightenment, through the unique instant of wisdom that is the vajra-like meditative stability.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཕྱིན་ཆད་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཟིགས་པ། ཆོས་ཐམས་ཅད་དབང་སྒྱུར་བ་ཞེས་བྱའོ།
en: And in the period after they have attained consummate buddhahood in unsurpassed, complete enlightenment, those bodhisattvas are said to be omniscient tathāgatas who have mastered all phenomena.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་དབེན་པ་ལགས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, if all phenomena are devoid of inherent existence, how do bodhisattva great beings refine the buddhafields?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བདག་དང་གཞན་གྱི་ལུས་ཀྱི་གནས་ངན་ལེན་དང་། ངག་གི་གནས་ངན་ལེན་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་ཡོངས་སུ་སྦྱོང་སྟེ། དེ་ཡོངས་སུ་དག་པར་བྱས་པས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།། །།
en: In this regard, Subhūti,” replied the Blessed One, “commencing from their setting of the mind on enlightenment, bodhisattva great beings purify themselves and others of the factors of body, speech, and mind that take on negative states. {

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: Ki.

source: བམ་པོ་བདུན་ཅུ་གསུམ་པ།
en: VIII: 125} Through those acts of purification they refine the buddhafields.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ལུས་ཀྱི་གནས་ངན་ལེན་ནི་གང་ལགས། ངག་གི་གནས་ངན་ལེན་ནི་གང་ལགས། ཡིད་ཀྱི་གནས་ངན་ལེན་ནི་གང་ལགས།
en: Blessed Lord, what are the factors of the body that take on negative states, the factors of speech that take on negative states, and the factors of mind that take on negative states?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལུས་ཀྱི་ལས་མི་དགེ་བ་སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་སྤྱོད་པ་ནི། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གནས་ངན་ལེན་ཏོ།
en: The Blessed One replied, “Physical nonvirtuous actions—the killing of living creatures, the stealing of what is not given, and sexual misconduct due to desire—constitute factors of the body that take on negative states for a bodhisattva.

source: །ངག་གི་ལས་མི་དགེ་བ་བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པའི་ཚིག་དང་། ཚིག་ཀྱལ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་གནས་ངན་ལེན་ཏོ།
en: Verbal nonvirtuous actions—the telling of lies, slander, verbal abuse, and irresponsible chatter—constitute factors of speech that take on negative states for a bodhisattva.

source: །ཡིད་ཀྱི་ལས་མི་དགེ་བ་ཆགས་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡིད་ཀྱི་གནས་ངན་ལེན་ཏོ།
en: Mental nonvirtuous actions—covetousness, malice, and wrong views—constitute factors of mind that take on negative states for a bodhisattva. “

source: །རབ་འབྱོར་གཞན་ཡང་སེར་སྣའི་སེམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡིད་ཀྱི་གནས་ངན་ལེན་ཏོ།
en: Moreover, Subhūti, thoughts of miserliness are factors of mind that take on negative states for a bodhisattva.

source: །ཚུལ་ཁྲིམས་ངན་པའི་སེམས་དང་། འཁྲུག་པའི་སེམས་དང་ལེ་ལོའི་སེམས་དང་། གཡེང་བའི་སེམས་དང་། མཉམ་པར་མ་བཞག་པའི་སེམས་དང་། ཤེས་རབ་འཆལ་པའི་སེམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡིད་ཀྱི་གནས་ངན་ལེན་ཏོ།
en: Thoughts of degenerate morality, thoughts of agitation, thoughts of indolence, thoughts of distraction, thoughts of noncomposure, and thoughts of stupidity are factors of mind that take on negative states for a bodhisattva. “

source: །རབ་འབྱོར་གཞན་ཡང་ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་དག་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: Moreover, Subhūti, impure ethical discipline is a factor that takes on negative states for a bodhisattva.

source: །རབ་འབྱོར་གཞན་ཡང་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་བྲལ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: The lack of the four applications of mindfulness is a factor that takes on negative states for a bodhisattva.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་བྲལ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: The lack of the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path is a factor that takes on negative states for a bodhisattva.

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། །མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་བྲལ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: The lack of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness is a factor that takes on negative states for a bodhisattva. “

source: །རབ་འབྱོར་གཞན་ཡང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་དུ་བྱེད་པ་འམ། དེ་ལ་འདོད་པ་སྐྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: Moreover, Subhūti, the actualizing of or longing for the fruit of entering the stream to nirvāṇa is a factor that takes on negative states for a bodhisattva.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱེད་པ་འམ། དེ་ལ་འདོད་པ་སྐྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: The actualizing of or longing for the fruit of being destined for only one more rebirth is a factor that takes on negative states for a bodhisattva.

source: །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱེད་པ་འམ། དེ་ལ་འདོད་པ་སྐྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: The actualizing of or longing for the fruit of no longer being subject to rebirth is a factor that takes on negative states for a bodhisattva.

source: །དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱེད་པ་འམ། དེ་ལ་འདོད་པ་སྐྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: The actualizing of or longing for arhatship is a factor that takes on negative states for a bodhisattva.

source: །རང་བྱང་ཆུབ་མངོན་དུ་བྱེད་པ་འམ། དེ་ལ་འདོད་པ་སྐྱེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གནས་ངན་ལེན་ཏོ།
en: The actualizing of or longing for individual enlightenment is a factor that takes on negative states for a bodhisattva. {Ki.

source: །རབ་འབྱོར་གཞན་ཡང་གཟུགས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: VIII: 126} “Moreover, Subhūti, any notion of physical forms constitutes a factor that takes on negative states.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of feelings, perceptions, formative predispositions, or consciousness constitutes a factor that takes on negative states.

source: །མིག་གི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of the eyes constitutes a factor that takes on negative states.

source: །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of the ears, nose, tongue, body, or mental faculty constitutes a factor that takes on negative states.

source: །གཟུགས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of sights constitutes a factor that takes on negative states.

source: །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of sounds, odors, tastes, tangibles, or mental phenomena constitutes a factor that takes on negative states.

source: །མིག་གི་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of visual consciousness constitutes a factor that takes on negative states.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness constitutes a factor that takes on negative states.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of visually compounded sensory contact constitutes a factor that takes on negative states.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, or mentally compounded sensory contact constitutes a factor that takes on negative states.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of feelings conditioned by visually compounded sensory contact constitutes a factor that takes on negative states.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, or feelings conditioned by mentally compounded sensory contact constitutes a factor that takes on negative states.

source: །སའི་ཁམས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of the earth element constitutes a factor that takes on negative states.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of the water element, the fire element, the wind element, the space element, or the consciousness element constitutes a factor that takes on negative states. “

source: །མ་རིག་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: Any notion of ignorance constitutes a factor that takes on negative states.

source: སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤིའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ། །བུད་མེད་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of women constitutes a factor that takes on negative states.

source: །སྐྱེས་པའི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of men constitutes a factor that takes on negative states.

source: །འདོད་པའི་ཁམས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ།
en: Any notion of the realm of desire constitutes a factor that takes on negative states.

source: །གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ། །དགེ་བའི་འདུ་ཤེས་དང་།
en: Any notion of the realm of form or the realm of formlessness constitutes a factor that takes on negative states.

source: མི་དགེ་བའི་འདུ་ཤེས་དང་། འཇིག་རྟེན་པའི་འདུ་ཤེས་དང་། འཇིག་རྟེན་ལས་འདས་པའི་འདུ་ཤེས་དང་། ཟག་པ་དང་བཅས་པའི་འདུ་ཤེས་དང་། ཟག་པ་མེད་པའི་འདུ་ཤེས་དང་།
en: Any notion of virtuous phenomena, any notion of nonvirtuous phenomena, any notion of mundane phenomena, any notion of supramundane phenomena, any notion of contaminated phenomena, any notion of uncontaminated phenomena, any notion of conditioned phenomena, or any notion of unconditioned phenomena constitutes a factor that takes on negative states.

source: འདུས་བྱས་ཀྱི་འདུ་ཤེས་དང་། འདུས་མ་བྱས་ཀྱི་འདུ་ཤེས་ནི་གནས་ངན་ལེན་ཏོ། །རབ་འབྱོར་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་གནས་ངན་ལེན་དང་། ངག་གི་གནས་ངན་ལེན་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་ཏོ།
en: These, Subhūti, constitute the factors of the body that take on negative states, the factors of speech that take on negative states, and the factors of mind that take on negative states. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: When bodhisattva great beings practice the perfection of wisdom, they have abandoned all these aspects of the factors that take on negative states.

source: གནས་ངན་ལེན་དེ་ཐམས་ཅད་རྣམ་པར་སྤངས་ཤིང་བདག་ཀྱང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་།
en: They themselves dispense generosity and they also encourage others to [dispense] generosity.

source: གཞན་ཡང་སྦྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་ཏེ། དེ་ཟས་འདོད་པ་ལ་ནི་ཟས་ཡོངས་སུ་གཏོང་ངོ་། །སྐོམ་འདོད་པ་ལ་ནི་སྐོམ། གོས་འདོད་པ་ལ་ནི་གོས་ཡོངས་སུ་གཏོང་། མིའི་རྐྱེན་དང་ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་འདོད་པ་ལ་ནི་དེ་དག་ཡོངས་སུ་གཏོང་སྟེ།
en: That is to say, they give food to those who need food, they give drink to those who need drink, they give clothing to those who need clothing, and they give [other gifts], up to and including all human necessities and resources whatsoever, to those who need them.

source: གཞན་ཡང་མིའི་རྐྱེན་དང་། ཡོ་བྱད་གང་ཅི་ཡང་རུང་བའི་བར་དུ་ཡོངས་སུ་གཏོང་བ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་རབ་ཏུ་འགོད་དེ།
en: They also encourage others to [give those gifts], up to and including all human necessities and resources whatsoever, and establish them there. {Ki.

source: དེའི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོའོ།
en: VIII: 127} Making common cause with all beings, they then dedicate all these roots of virtuous action, as many as there are, so that the buddhafields might be refined. “

source: །དེ་བདག་ཉིད་ཀྱང་ཚུལ་ཁྲིམས་སྲུང་ངོ་། །གཞན་ཡང་ཚུལ་ཁྲིམས་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They themselves maintain ethical discipline and they also encourage others to maintain ethical discipline.

source: །བདག་ཀྱང་བཟོད་པ་སྒོམ་མོ། །གཞན་ཡང་བཟོད་པ་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They themselves cultivate tolerance and they also encourage others to [cultivate] tolerance.

source: །བདག་ཀྱང་བརྩོན་འགྲུས་རྩོམ་མོ། །གཞན་ཡང་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་སྐུལ་ལོ།
en: They themselves undertake acts of perseverance and they also encourage others to [undertake] acts of perseverance.

source: །བདག་ཀྱང་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་གོ །གཞན་ཡང་བསམ་གཏན་ལ་ཡང་དག་པར་སྐུལ་ལོ། །བདག་ཀྱང་ཤེས་རབ་སྒོམ་མོ།
en: They themselves are absorbed in meditative concentration and they also encourage others to [be absorbed in] meditative concentration.

source: །གཞན་ཡང་ཤེས་རབ་ལ་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་གོ །འདུལ་ལོ། །རབ་ཏུ་འགོད་དོ།
en: They themselves cultivate wisdom and they also encourage others to [cultivate] wisdom, and they settle, discipline, and establish them there.

source: །དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་སྟེ།
en: Making common cause with all beings, they then dedicate these roots of virtuous action so that the buddhafields might be refined.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་ཞིང་། དཀོན་མཆོག་གསུམ་ལ་འབུལ་བ་བྱེད་ཀྱང་དེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྒྱུ་ལས་གྲུབ་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ།
en: They fill the world systems of the great trichiliocosm with the seven precious materials, and offer them to the Three Precious Jewels, indeed thinking, ‘Through these roots of virtuous action, may this buddhafield of mine be fashioned of the seven precious materials!’ “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་སྤྱན་སྔ་འམ། སངས་རྒྱས་ཀྱི་མཆོད་རྟེན་གྱི་དྲུང་དུ་ལྷ་རྫས་ཀྱི་རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བ་བྱེད་ཀྱང་། དེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ལྷ་རྫས་ཀྱི་སྒྲ་ཡིད་དུ་འོང་བ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་འབྱུང་བར་གྱུར་ཅིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ།
en: Moreover, Subhūti, bodhisattva great beings play divine music in the presence of the buddhas or alongside the reliquary stūpas of the buddhas, while thinking, ‘Through these roots of virtuous action, may the pleasant sound of divine music always arise, without interruption, in this buddhafield of mine!’ “

source: །རབ་འབྱོར་གཞན་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྷ་རྫས་ཀྱི་སྤོས་ཀྱིས་ཡོངས་སུ་བཀང་ཞིང་། སངས་རྒྱས་རྣམས་སམ། སངས་རྒྱས་ཀྱི་མཆོད་རྟེན་དག་ལ་འབུལ་བ་བྱེད་ཀྱང་། དེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་ངད་ལྡང་བར་གྱུར་ཅིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ།
en: Moreover, Subhūti, they fill the world systems of the great trichiliocosm with divine perfumes, and they worship the buddhas or the reliquary stūpas of the buddhas, while thinking, ‘Through these roots of virtuous action, may the fragrance of divine perfume always arise, without interruption, in this buddhafield of mine!’ “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་དེ་བཞིན་གཤེགས་པ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ལ་འབུལ་བ་བྱེད་ཅིང་། དེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་པ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ། མནབས་སྩལ་རོ་བརྒྱ་དང་ལྡན་པ་མངོན་པར་གྲུབ་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ།
en: Moreover, Subhūti, bodhisattva great beings make offerings of food with a hundred flavors to the tathāgatas or to the śrāvakas of the tathāgatas, while thinking, ‘Through these roots of virtuous action, may I attain consummate buddhahood in unsurpassed, complete enlightenment, in this buddhafield of mine, and may foods with a hundred flavors materialize for the saṅgha of śrāvakas!’ “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དག་ལ་ལྷ་རྫས་ཀྱི་བྱུག་པ་ཡོངས་སུ་འབུལ་བ་བྱེད་ཀྱང་དེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་སེམས་ཅན་ཐམས་ཅད་ལྷ་རྫས་ཀྱི་རེག་པ་དང་ལྡན་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ། ཡིད་ཀྱིས་བསམས་པ་ཙམ་གྱིས་ཡིད་དུ་འོང་བའི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་།
en: Moreover, Subhūti, bodhisattva great beings make offerings of divine unguents to the tathāgatas or to the reliquary stūpas of the tathāgatas, while thinking, ‘Through these roots of virtuous action, may all beings of this buddhafield where I attain consummate buddhahood in unsurpassed, complete enlightenment possess divine unguents.

source: རོ་དང་།
en: ’{Ki.

source: རེག་རྣམས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ཉན་ཐོས་རྣམས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དབུལ་ཞིང་ཡོངས་སུ་གཏང་བར་བྱའོ་སྙམ་དུ་སེམས་ཏེ། དེ་དེ་ལྟར་སེམས་པའི་ཚེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཡིད་ཀྱིས་བསམས་པ་ཙམ་གྱིས་ཡིད་དུ་འོང་བའི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་།
en: VIII: 128} “Moreover, Subhūti, bodhisattva great beings, simply through the good intentions that arise in their minds, think that they should make offerings and donate pleasant sights, sounds, odors, tastes, and tangibles to the lord buddhas, the śrāvakas, and all beings, and when they have such thoughts, they further think, ‘Through these roots of virtuous action, may I attain consummate buddhahood in unsurpassed, complete enlightenment, in this buddhafield of mine, and, simply through the good intentions that arise in my mind, may the saṅgha of śrāvakas and all beings, too, acquire pleasant sights, sounds, odors, tastes, and tangibles!’ “

source: རོ་དང་། རེག་ཡོངས་སུ་གྲུབ་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་སེམས་ཏེ། མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་བསམ་གཏན་དང་པོ་ལ་མཉམ་པར་གཞག་གོ །
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they think, ‘Now I should become absorbed in the first meditative concentration.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་བསམ་གཏན་དང་པོ་ལ་དགོད་དོ།
en: I should also establish all beings in the first meditative concentration.

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་བསམ་གཏན་གཉིས་པ་དང་། གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་མཉམ་པར་གཞག་གོ །
en: Now I should become absorbed in the second, third, and fourth meditative concentrations.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་བསམ་གཏན་བཞི་པ་ལ་དགོད་དོ།
en: I should also establish all beings in the fourth meditative concentration [and so forth].
